In [2]:
%matplotlib inline

import numpy as np
import matplotlib.pyplot as plt
import pandas as pd

In [3]:
mydata = np.random.randn(3,4)

In [4]:
mydata

array([[-0.87601718, -1.15842188,  0.36850523, -1.04450712],
       [-1.30417276,  0.55119224, -0.09969758, -0.74561182],
       [ 0.60511438,  0.07470895,  0.81097186, -0.88716763]])

In [5]:
list("ABCDE")

['A', 'B', 'C', 'D', 'E']

In [7]:
df1 = pd.DataFrame(mydata, columns=list("ABCD"))

In [8]:
df1

          A         B         C         D
0 -0.876017 -1.158422  0.368505 -1.044507
1 -1.304173  0.551192 -0.099698 -0.745612
2  0.605114  0.074709  0.810972 -0.887168

In [9]:
df2 = pd.DataFrame(np.random.randn(3,4), columns = list("ABCD"))

In [10]:
df2

          A         B         C         D
0 -0.354824  0.111419 -0.255955 -0.950162
1  0.641265  0.191310  0.601894  0.783055
2  0.232504 -0.245050  0.871977 -0.807718

In [12]:
df3 = pd.concat([df1,df2], axis=0)

In [13]:
df3

          A         B         C         D
0 -0.876017 -1.158422  0.368505 -1.044507
1 -1.304173  0.551192 -0.099698 -0.745612
2  0.605114  0.074709  0.810972 -0.887168
0 -0.354824  0.111419 -0.255955 -0.950162
1  0.641265  0.191310  0.601894  0.783055
2  0.232504 -0.245050  0.871977 -0.807718

In [18]:
df3.index = range(6)

In [16]:
df3

          A         B         C         D
0 -0.876017 -1.158422  0.368505 -1.044507
1 -1.304173  0.551192 -0.099698 -0.745612
2  0.605114  0.074709  0.810972 -0.887168
3 -0.354824  0.111419 -0.255955 -0.950162
4  0.641265  0.191310  0.601894  0.783055
5  0.232504 -0.245050  0.871977 -0.807718

In [20]:
df4 = pd.concat([df1,df2], axis=1)

In [21]:
df4

,A,B,C,D,A,B,C,D
0,-0.876017,-1.158422,0.368505,-1.044507,-0.354824,0.111419,-0.255955,-0.950162
1,-1.304173,0.551192,-0.099698,-0.745612,0.641265,0.191310,0.601894,0.783055
2,0.605114,0.074709,0.810972,-0.887168,0.232504,-0.245050,0.871977,-0.807718